In [1]:
import numpy as np
import pandas as pd

In [3]:
# Creating series using dictionary
capitals = {"Pakistan": "Islamabad", "India": "Delhi", "Afghanistan":"Kabul"}
captials_series = pd.Series(capitals)
captials_series

Pakistan       Islamabad
India              Delhi
Afghanistan        Kabul
dtype: object

In [5]:
# Creating Dicitionary
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df = pd.DataFrame(data)
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [14]:
# Inded Objects
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 3]}
df = pd.DataFrame(data)
df.set_index('Name', inplace=True)
print(df)
print("Accessing element using index\n",df.loc['Alice'])

         Age
Name
Alice     25
Bob       30
Charlie    3
Accessing element using index
 Age    25
Name: Alice, dtype: int64

In [17]:
# Reindexing with forward fill
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
index=['a', 'c', 'd'],
columns=['Ohio', 'Texas', 'California'])

frame.reindex(['a','b' ,'c', 'd'] , method='ffill')

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [21]:
# Dropping Rows & Columns
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])

print(data)
data.drop('Utah')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York   12   13     14    15

In [22]:
data.drop(['three','four'], axis=1)

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [23]:
# Selecting data with loc and iloc
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [25]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [30]:
# Dataframe Arithmetic
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'A': [2, 3]})
print(df1)
print(df2)
df1+df2

   A
0  1
1  2
   A
0  2
1  3

   A
0  3
1  5